app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sun, 02 Feb 2014 06:05:55 UTC +00:00], ["email", "aaa@qq.com"], ["updated_at", Sun, 02 Feb 2014 06:05:55 UTC +00:00]]